<a href="https://colab.research.google.com/github/GitMishka/1/blob/main/data_eng.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [24, 27, 22],
    'City': ['New York', 'Los Angeles', 'Chicago']
}

In [3]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [24, 27, 22],
    'City': ['New York', 'Los Angeles', 'Chicago']
}

df = pd.DataFrame(data)
print(df)

      Name  Age         City
0    Alice   24     New York
1      Bob   27  Los Angeles
2  Charlie   22      Chicago

In [4]:
print(df['Age'])

0    24
1    27
2    22
Name: Age, dtype: int64

In [5]:
print(df[df['Age'] > 23])

    Name  Age         City
0  Alice   24     New York
1    Bob   27  Los Angeles

In [6]:
df['Years of Experience'] = [2, 6, 1]
print(df)

      Name  Age         City  Years of Experience
0    Alice   24     New York                    2
1      Bob   27  Los Angeles                    6
2  Charlie   22      Chicago                    1

In [7]:
average_age = df['Age'].mean()
print(f"Average Age: {average_age}")

Average Age: 24.333333333333332

In [8]:
df.to_csv('exported_data.csv', index=False)

In [9]:
grouped_data = df.groupby('City')['Age'].mean()
print(grouped_data)

City
Chicago        22.0
Los Angeles    27.0
New York       24.0
Name: Age, dtype: float64

In [10]:
data_with_nans = {
    'A': [1, 2, None, 4],
    'B': [5, None, None, 8],
    'C': [9, 10, 11, 12]
}

In [11]:
df_with_nans = pd.DataFrame(data_with_nans)
df_filled = df_with_nans.fillna(df_with_nans.mean())
print(df_filled)

          A    B   C
0  1.000000  5.0   9
1  2.000000  6.5  10
2  2.333333  6.5  11
3  4.000000  8.0  12

In [12]:
df1 = pd.DataFrame({'ID': [1, 2, 3], 'Name': ['Alice', 'Bob', 'Charlie']})
df2 = pd.DataFrame({'ID': [1, 2, 4], 'Age': [24, 27, 26]})

In [13]:
merged_df = pd.merge(df1, df2, on='ID', how='inner')
print(merged_df)

   ID   Name  Age
0   1  Alice   24
1   2    Bob   27

In [ ]:
WITH RankedSales AS (
    SELECT
        product_id,
        amount_in_sales,
        amount_sold,
        RANK() OVER (PARTITION BY product_id ORDER BY amount_in_sales DESC) AS sales_rank
    FROM
        sales
)
SELECT
    product_id,
    amount_in_sales,
    amount_sold
FROM
    RankedSales
WHERE
    sales_rank <= 10;

In [ ]:
WITH TotalSales AS (
    SELECT
        customer_id,
        SUM(amount_in_sales) AS total_sales
    FROM
        sales
    GROUP BY
        customer_id
)
SELECT
    customer_id,
    total_sales
FROM
    TotalSales
ORDER BY
    total_sales DESC
LIMIT 5;

In [ ]:
WITH SalesRanking AS (
    SELECT
        employee_id,
        COUNT(*) AS number_of_sales,
        RANK() OVER (ORDER BY COUNT(*) DESC) AS rank
    FROM
        sales
    GROUP BY
        employee_id
)
SELECT
    employee_id,
    number_of_sales,
    rank
FROM
    SalesRanking;